Repository: nourankhaled22/Smart-Prescription-System
Catalog: FrontEnd/lib/l10n/app_*.arb
Languages: ar

source: Welcome Back
ar: مرحبًا بعودتك

# pleaseLogin
source: Please login to continue
ar: الرجاء تسجيل الدخول للمتابعة

# phone
source: Phone Number
ar: رقم الهاتف

# enterPhone
source: Please enter your phone number
ar: يرجى إدخال رقم هاتفك

source: Password
ar: كلمة المرور

# enterPassword
source: Enter your password
ar: أدخل كلمة المرور

source: Forgot Password
ar: نسيت كلمة المرور

source: Reset Password
ar: إعادة تعيين كلمة المرور

# resetPasswordDesc
source: Enter your phone number and we'll send you a verification code to reset your password.
ar: أدخل رقم هاتفك وسنرسل لك رمز تحقق لإعادة تعيين كلمة المرور.

source: Phone Number
ar: رقم الهاتف

source: Send Verification Code
ar: إرسال رمز التحقق

source: Back to Login
ar: العودة لتسجيل الدخول

source: Please enter phone number
ar: من فضلك أدخل رقم الهاتف

# pleaseEnterValidPhoneNumber
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صحيح

# failedToResendOtp
source: Failed to resend OTP: {error}
ar: فشل في إعادة إرسال رمز التحقق: {error}

source: Enter Verification Code
ar: أدخل رمز التحقق

# verificationDesc
source: We sent a 6-digit verification code to {phone} on WhatsApp.
ar: تم إرسال رمز تحقق مكون من 6 أرقام إلى {phone} على واتساب.

source: Resend Code
ar: إعادة إرسال الرمز

# resendCodeIn
source: Resend code in {seconds} seconds
ar: إعادة إرسال الرمز خلال {seconds} ثانية

source: Verify Code
ar: تحقق من الرمز

source: OTP verified!
ar: تم التحقق من الرمز!

# otpVerificationFailed
source: OTP verification failed: {error}
ar: فشل التحقق من الرمز: {error}

source: OTP must be numeric
ar: يجب أن يكون الرمز أرقامًا فقط

# pleaseEnterCompleteVerificationCode
source: Please enter the complete verification code
ar: يرجى إدخال رمز التحقق الكامل

source: OTP resent successfully!
ar: تمت إعادة إرسال الرمز بنجاح!

source: Verification code sent
ar: تم إرسال رمز التحقق

source: Create New Password
ar: إنشاء كلمة مرور جديدة

source: New Password
ar: كلمة المرور الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

# passwordDesc
source: Your new password must be different from your previous password.
ar: يجب أن تكون كلمة المرور الجديدة مختلفة عن السابقة.

source: Enter new password
ar: أدخل كلمة المرور الجديدة

source: Confirm new password
ar: تأكيد كلمة المرور الجديدة

# passwordReset
source: Reset Password
ar: إعادة تعيين كلمة المرور

# pleaseFillAllFields
source: Please fill in all required fields
ar: يرجى ملء جميع الحقول المطلوبة

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

# passwordMinLength
source: Password must be at least 6 characters
ar: يجب أن تكون كلمة المرور 6 أحرف على الأقل

# passwordResetSuccess
source: Password reset successfully!
ar: تمت إعادة تعيين كلمة المرور بنجاح!

# passwordResetFailed
source: Password reset failed: {error}
ar: فشل في إعادة تعيين كلمة المرور: {error}

source: Allergies
ar: الحساسية

source: Search allergies...
ar: ابحث عن الحساسية...

source: Filter:
ar: تصفية:

source: Today
ar: اليوم

source: Month
ar: شهر

# threeMonths
source: 3M
ar: ٣ أشهر

# sixMonths
source: 6M
ar: ٦ أشهر

source: Custom
ar: مخصص

source: Add New Allergy
ar: إضافة حساسية جديدة

source: Total
ar: الإجمالي

source: No allergies found
ar: لا توجد حساسية

# addFirstAllergy
source: Add your first allergy or try a different search
ar: أضف أول حساسية أو جرب بحثًا مختلفًا

source: Edit Allergy
ar: تعديل الحساسية

source: Delete Allergy
ar: حذف الحساسية

source: Date
ar: التاريخ

source: Allergy Name
ar: اسم الحساسية

source: Enter allergy name
ar: أدخل اسم الحساسية

source: Save Allergy
ar: حفظ الحساسية

source: Update Allergy
ar: تحديث الحساسية

source: Vaccines
ar: اللقاحات

source: Search vaccines...
ar: ابحث عن اللقاحات...

source: Add New Vaccine
ar: إضافة لقاح جديد

source: No vaccines found
ar: لا توجد لقاحات

# addFirstVaccine
source: Add your first vaccine or try a different search
ar: أضف أول لقاح أو جرب بحثًا مختلفًا

source: Edit Vaccine
ar: تعديل اللقاح

source: Delete Vaccine
ar: حذف اللقاح

source: Vaccine Name
ar: اسم اللقاح

source: Enter vaccine name
ar: أدخل اسم اللقاح

source: Enter Date
ar: أدخل التاريخ

source: Save Vaccine
ar: حفظ اللقاح

source: Update Vaccine
ar: تحديث اللقاح

# chronics
source: Chronic Diseases
ar: الأمراض المزمنة

# searchChronics
source: Search chronic diseases...
ar: ابحث عن الأمراض المزمنة...

# addNewChronic
source: Add New Chronic Disease
ar: إضافة مرض مزمن جديد

# noChronicsFound
source: No chronic diseases found
ar: لا توجد أمراض مزمنة

# addFirstChronic
source: Add your first chronic disease or try a different search
ar: أضف أول مرض مزمن أو جرب بحثًا مختلفًا

# editChronic
source: Edit Chronic Disease
ar: تعديل المرض المزمن

# deleteChronic
source: Delete Chronic Disease
ar: حذف المرض المزمن

# chronicName
source: Disease Name
ar: اسم المرض

# enterChronicName
source: Enter disease name
ar: أدخل اسم المرض

# saveChronic
source: Save Chronic Disease
ar: حفظ المرض المزمن

# updateChronic
source: Update Chronic Disease
ar: تحديث المرض المزمن

source: Medical Examinations
ar: الفحوصات الطبية

source: Search examinations...
ar: ابحث عن الفحوصات...

source: Add New Examination
ar: إضافة فحص جديد

source: Save Examination
ar: حفظ الفحص

source: Update Examination
ar: تحديث الفحص

source: Edit Examination
ar: تعديل الفحص

source: Delete Examination
ar: حذف الفحص

source: Examination Name *
ar: اسم الفحص *

source: Enter examination name
ar: أدخل اسم الفحص

source: Upload PDF
ar: رفع ملف PDF

source: Upload PDF file
ar: رفع ملف PDF

source: Download
ar: تنزيل

source: No examinations found
ar: لا توجد فحوصات

# addFirstExamination
source: Add your first examination or try a different search
ar: أضف أول فحص أو جرب بحثًا مختلفًا

source: All
ar: الكل

source: Notes
ar: ملاحظات

# pleaseSelectDate
source: Please select a date
ar: يرجى اختيار التاريخ

# pleaseUploadPdf
source: Please upload a PDF file
ar: يرجى رفع ملف PDF

# examinationUploaded
source: Examination uploaded successfully!
ar: تم رفع الفحص بنجاح!

# examinationUpdated
source: Examination updated successfully!
ar: تم تحديث الفحص بنجاح!

source: Failed to upload examination
ar: فشل في رفع الفحص

source: Failed to update examination
ar: فشل في تحديث الفحص

source: Failed to fetch examinations
ar: فشل في جلب الفحوصات

source: Failed to delete
ar: فشل في الحذف

# authenticationError
source: Authentication error. Please login again.
ar: خطأ في المصادقة. يرجى تسجيل الدخول مرة أخرى.

source: Open
ar: فتح

source: Medicine
ar: الدواء

source: Add New Medicine
ar: إضافة دواء جديد

source: Your Medications
ar: أدويتك

source: No medications found
ar: لا توجد أدوية

# addFirstMedicine
source: Add your first medicine or try a different search
ar: أضف أول دواء أو جرب بحثًا مختلفًا

source: Add Medicine
ar: إضافة دواء

source: Delete
ar: حذف

source: deleted
ar: تم الحذف

source: Undo
ar: تراجع

source: restored
ar: تم الاسترجاع

source: Scan Medicine
ar: مسح الدواء

source: Take Photo
ar: التقاط صورة

source: From Gallery
ar: من المعرض

source: Error opening camera
ar: خطأ في فتح الكاميرا

# medicineAdded
source: Medicine added successfully!
ar: تمت إضافة الدواء بنجاح!

source: OK
ar: موافق

source: Medication Center
ar: مركز الأدوية

# manageMedications
source: Manage your medications or explore drug information
ar: إدارة أدويتك أو استكشاف معلومات الأدوية

source: My Medications
ar: أدويتي

# trackMedications
source: Track your current medications, set reminders, and manage dosages
ar: تتبع أدويتك الحالية، واضبط التذكيرات، وأدر الجرعات

source: Medication Analytics
ar: تحليلات الأدوية

# viewAnalytics
source: View dynamic charts, track adherence, and analyze medication patterns
ar: عرض الرسوم البيانية الديناميكية وتتبع الالتزام وتحليل أنماط الأدوية

source: Drug Information
ar: معلومات الدواء

# searchLearn
source: Search and learn about medications, side effects, and interactions
ar: ابحث وتعرف على الأدوية، الآثار الجانبية، والتفاعلات

source: Quick Tip
ar: نصيحة سريعة

# consultProvider
source: Always consult with your healthcare provider before starting, stopping, or changing any medication.
ar: استشر مقدم الرعاية الصحية قبل بدء أو إيقاف أو تغيير أي دواء.

# dataSecure
source: All medication data is securely stored and protected
ar: جميع بيانات الأدوية مخزنة ومحفوظة بأمان

source: Medication Details
ar: تفاصيل الدواء

source: Active
ar: نشط

source: Paused
ar: موقوف

source: Pause
ar: إيقاف

source: Activate
ar: تفعيل

source: Dosage Information
ar: معلومات الجرعة

source: Dosage
ar: الجرعة

source: Frequency
ar: التكرار

source: Duration
ar: المدة

source: Timing
ar: التوقيت

source: After Meal
ar: بعد الأكل

source: Before Meal
ar: قبل الأكل

source: Schedule
ar: الجدول

source: Times
ar: الأوقات

source: Next Dose
ar: الجرعة التالية

source: Quick Actions
ar: إجراءات سريعة

source: Medicine Info
ar: معلومات الدواء

source: Search for medicine name...
ar: ابحث عن اسم الدواء...

# searchingMedicineInfo
source: Searching medicine information...
ar: جاري البحث عن معلومات الدواء...

source: Search for Medicine Information
ar: ابحث عن معلومات الدواء

# enterMedicineNameInfo
source: Enter a medicine name to get detailed information
ar: أدخل اسم الدواء للحصول على معلومات مفصلة

# examples
source: Examples: Aspirin, Metformin, Lisinopril
ar: أمثلة: أسبرين، ميتفورمين، ليسينوبريل

source: Medicine Not Found
ar: لم يتم العثور على الدواء

# medicineNotFoundDesc
source: We couldn't find information for "{medicineName}" Try searching with a different name
ar: لم نتمكن من العثور على معلومات لـ "{medicineName}" جرب البحث باسم مختلف

source: Search Again
ar: ابحث مرة أخرى

source: Error
ar: خطأ

source: Try Again
ar: حاول مرة أخرى

source: Description
ar: الوصف

# noDescription
source: No description available
ar: لا يوجد وصف متاح

source: Active Ingredient
ar: المكون الفعال

# dosageAdmin
source: Dosage & Administration
ar: الجرعة وطريقة الاستعمال

source: Alternative Medicines
ar: بدائل الدواء

source: Side Effects
ar: الآثار الجانبية

source: Warnings
ar: تحذيرات

source: Medication
ar: دواء

# fetchMedicineError
source: Failed to fetch medicine information. Please check your internet connection and try again.
ar: فشل في جلب معلومات الدواء. يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى.

source: Save Medicine
ar: حفظ الدواء

source: Medicine Name
ar: اسم الدواء

source: Please enter medicine name
ar: يرجى إدخال اسم الدواء

source: Dose
ar: الجرعة

source: Enter dose amount
ar: أدخل كمية الجرعة

source: Times per Day
ar: عدد المرات في اليوم

source: When to Take
ar: متى يؤخذ

# afterMealOption
source: After Meal
ar: بعد الأكل

# afterMealDesc
source: Take medicine after eating
ar: تناول الدواء بعد الأكل

# beforeMealOption
source: Before Meal
ar: قبل الأكل

# beforeMealDesc
source: Take medicine before eating
ar: تناول الدواء قبل الأكل

source: Save Schedule
ar: حفظ الجدول

source: Enter Start Date
ar: أدخل تاريخ البدء

source: Select start date
ar: اختر تاريخ البدء

source: Enter Start Time
ar: أدخل وقت البدء

source: Select start time
ar: اختر وقت البدء

source: Hours per day
ar: عدد الساعات في اليوم

# scheduleSaved
source: Schedule saved for {medicineName}
ar: تم حفظ الجدول لـ {medicineName}

# pleaseSelectDateTime
source: Please select both date and time
ar: يرجى اختيار كل من التاريخ والوقت

source: Admin Dashboard
ar: لوحة تحكم المدير

source: Doctor Dashboard
ar: لوحة تحكم الطبيب

source: Patient Dashboard
ar: لوحة تحكم المريض

# welcome
source: Welcome, {name}
ar: مرحبًا، {name}

# howCanWeHelp
source: How can we help you today?
ar: كيف يمكننا مساعدتك اليوم؟

source: Manage Doctors
ar: إدارة الأطباء

source: Manage Patients
ar: إدارة المرضى

source: Verify Licenses
ar: التحقق من التراخيص

source: System Status
ar: حالة النظام

# allSystemsOperational
source: All systems operational. always check pending license verifications.
ar: جميع الأنظمة تعمل. تحقق من التراخيص قيد الانتظار.

source: Sign Out
ar: تسجيل الخروج

source: View Profile
ar: عرض الملف الشخصي

source: Start Session
ar: بدء جلسة

source: Session Records
ar: سجلات الجلسات

source: Professional Tip
ar: نصيحة مهنية

# verifyPatientIdentity
source: Always verify patient identity before starting consultation.
ar: تحقق دائمًا من هوية المريض قبل بدء الاستشارة.

source: Medical History
ar: التاريخ الطبي

source: Find Doctors
ar: البحث عن الأطباء

source: Ask Chatbot
ar: اسأل الروبوت

source: Health Tips
ar: نصائح صحية

source: Stay Hydrated
ar: حافظ على رطوبتك

# drinkWaterTip
source: Drink at least 8 glasses of water daily to maintain good health.
ar: اشرب 8 أكواب من الماء يوميًا للحفاظ على صحتك.

# areYouSureSignOut
source: Are you sure you want to sign out?
ar: هل أنت متأكد أنك تريد تسجيل الخروج؟

source: Update Password
ar: تحديث كلمة المرور

source: Change Password
ar: تغيير كلمة المرور

source: Cancel Change Password
ar: إلغاء تغيير كلمة المرور

source: Old Password
ar: كلمة المرور القديمة

source: Enter old password
ar: أدخل كلمة المرور القديمة

# enterAtLeast6Chars
source: Enter at least 6 characters
ar: أدخل 6 أحرف على الأقل

# profileUpdated
source: Profile updated successfully
ar: تم تحديث الملف الشخصي بنجاح

# failedToUpdateProfile
source: Failed to update profile: {error}
ar: فشل في تحديث الملف الشخصي: {error}

source: Show QR Code
ar: عرض رمز الاستجابة السريعة

source: Patient QR Code
ar: رمز المريض

source: National ID
ar: الرقم القومي

source: Save Changes
ar: حفظ التغييرات

source: First Name
ar: الاسم الأول

source: Last Name
ar: الاسم الاخير

source: Email
ar: الأيميل

source: Date Of Birth
ar: تاريخ الميلاد

source: Age
ar: العمر

# clinicAddress
source: Clinic Adress
ar: عنوان العيادة

source: Address
ar: العنوان

source: Specialization
ar: التخصص

source: Blood Pressure
ar: ضغط الدم

source: Blood Pressure Reading
ar: قراءة ضغط الدم

source: Edit Blood Pressure
ar: تعديل ضغط الدم

source: Edit Reading
ar: تعديل القراءة

source: Delete Reading
ar: حذف القراءة

# deleteReadingConfirm
source: Are you sure you want to delete this blood pressure reading?
ar: هل أنت متأكد أنك تريد حذف قراءة ضغط الدم هذه؟

source: Add New Reading
ar: إضافة قراءة جديدة

source: Record your blood pressure
ar: سجل ضغط دمك

source: Blood Pressure Values
ar: قيم ضغط الدم

source: Systolic
ar: الانقباضي

source: Diastolic
ar: الانبساطي

source: Pulse
ar: النبض

source: Upper number
ar: الرقم العلوي

source: Lower number
ar: الرقم السفلي

source: Heart rate (bpm)
ar: معدل ضربات القلب (نبضة/دقيقة)

# dateAndTime
source: Date & Time
ar: التاريخ والوقت

source: Time
ar: الوقت

source: Health Analysis
ar: تحليل صحي

source: Save Reading
ar: حفظ القراءة

source: Update Reading
ar: تحديث القراءة

# bloodPressureAdded
source: Blood pressure added successfully
ar: تمت إضافة ضغط الدم بنجاح

# bloodPressureUpdated
source: Blood pressure updated successfully
ar: تم تحديث ضغط الدم بنجاح

# bloodPressureDeleted
source: Blood pressure deleted successfully
ar: تم حذف ضغط الدم بنجاح

# failedToUpdateBloodPressure
source: Failed to update blood pressure: {error}
ar: فشل في تحديث ضغط الدم: {error}

# failedToDeleteBloodPressure
source: Failed to delete blood pressure: {error}
ar: فشل في حذف ضغط الدم: {error}

source: No readings found
ar: لا توجد قراءات

# noReadingsFoundFilters
source: No readings found for the selected filters
ar: لا توجد قراءات للفلاتر المحددة

source: Avg Sys
ar: متوسط الانقباضي

source: Avg Dia
ar: متوسط الانبساطي

source: Level
ar: المستوى

source: Normal
ar: طبيعي

source: High
ar: مرتفع

source: Low
ar: منخفض

# pleaseEnterSystolic
source: Please enter systolic value
ar: يرجى إدخال قيمة الانقباضي

# pleaseEnterDiastolic
source: Please enter diastolic value
ar: يرجى إدخال قيمة الانبساطي

# pleaseEnterPulse
source: Please enter pulse value
ar: يرجى إدخال قيمة النبض

# pleaseEnterValidNumber
source: Please enter a valid number
ar: يرجى إدخال رقم صحيح

# lowBpAdvice
source: Consider consulting your doctor if you experience symptoms like dizziness or fatigue.
ar: كر في استشارة طبيبك إذا كنت تعاني من أعراض مثل الدوخة أو التعب.

# normalBpAdvice
source: Great! Maintain a healthy lifestyle with regular exercise and balanced diet.
ar: رائع! حافظ على نمط حياة صحي من خلال ممارسة الرياضة بانتظام واتباع نظام غذائي متوازن.

# elevatedBpAdvice
source: Consider lifestyle changes like reducing sodium intake and increasing physical activity.
ar: خذ بعين الاعتبار تغييرات في نمط حياتك مثل تقليل تناول الصوديوم وزيادة النشاط البدني.

# highBpAdvice
source: Consult your healthcare provider for proper evaluation and treatment options.
ar: استشر مقدم الرعاية الصحية الخاص بك للحصول على التقييم المناسب وخيارات العلاج.

source: Elevated Blood Pressure
ar: ارتفاع ضغط الدم

source: Prescriptions
ar: الوصفات الطبية

source: Medical Prescriptions
ar: الوصفات الطبية

source: Add New Prescription
ar: إضافة وصفة جديدة

source: Add Prescription
ar: إضافة وصفة

source: Doctor Name
ar: اسم الطبيب

source: Enter doctor name
ar: أدخل اسم الطبيب

source: Enter specialization
ar: أدخل التخصص

source: Enter clinic address
ar: أدخل عنوان العيادة

source: Enter phone number
ar: أدخل رقم الهاتف

source: Medicines
ar: الأدوية

source: Enter medicine name
ar: أدخل اسم الدواء

source: Examinations
ar: الفحوصات

source: Enter examination
ar: أدخل الفحص

source: Diagnoses
ar: التشخيصات

# enterDiagnosis
source: Enter the patient's diagnosis and medical condition
ar: أدخل تشخيص وحالة المريض الطبية

source: Enter notes
ar: أدخل الملاحظات

source: Save Prescription
ar: حفظ الوصفة

source: Download PDF
ar: تحميل PDF

source: Delete Prescription
ar: حذف الوصفة

# deletePrescriptionConfirm
source: Are you sure you want to delete this prescription from Dr. {doctorName}?
ar: هل أنت متأكد أنك تريد حذف هذه الوصفة من الدكتور {doctorName}؟

# prescriptionDeleted
source: Prescription deleted successfully
ar: تم حذف الوصفة بنجاح

# prescriptionCaptured
source: Prescription captured successfully!
ar: تم التقاط الوصفة بنجاح!

# prescriptionPdfSaved
source: PDF saved to: {path}
ar: تم حفظ PDF في: {path}

source: No prescriptions found
ar: لا توجد وصفات طبية

# noPrescriptionsFoundRange
source: No prescriptions found for the selected date range
ar: لا توجد وصفات طبية لنطاق التاريخ المحدد

source: Range
ar: النطاق

# doctorNotes
source: Doctor's Notes
ar: ملاحظات الطبيب

source: Upload Image
ar: رفع صورة

source: Scan prescription
ar: مسح الوصفة

source: Please enter clinic address
ar: من فضلك أدخل عنوان العيادة

source: Please enter specialization
ar: من فضلك أدخل التخصص

source: Please enter doctor name
ar: من فضلك أدخل اسم الطبيب

source: Upload image file
ar: قم برفع ملف الصورة

source: Failed to upload PDF
ar: فشل في رفع ملف PDF

source: PDF uploaded successfully
ar: تم رفع ملف PDF بنجاح

source: Optional
ar: اختياري

source: Please enter at least one medicine
ar: يرجى إدخال دواء واحد على الأقل

source: Generating PDF
ar: جارٍ إنشاء ملف PDF

source: Failed to delete prescription
ar: فشل في حذف الوصفة الطبية

source: Downloading prescription
ar: جارٍ تحميل الوصفة الطبية

source: Error generating PDF
ar: حدث خطأ أثناء إنشاء ملف PDF

source: No data
ar: لا توجد بيانات

source: Failed to fetch prescriptions
ar: فشل في جلب الوصفات الطبية

source: Patient Registration
ar: تسجيل المريض

source: Doctor Registration
ar: تسجيل الطبيب

source: Personal Information
ar: المعلومات الشخصية

source: Account Information
ar: معلومات الحساب

source: Required
ar: مطلوب

# enterNationalId
source: Enter your national ID number
ar: أدخل رقمك القومي

# selectDateOfBirth
source: Please select your date of birth
ar: يرجى اختيار تاريخ الميلاد

# pleaseEnterAddress
source: Please enter an address
ar: يرجى إدخال العنوان

# confirmYourPassword
source: Please confirm your password
ar: يرجى تأكيد كلمة المرور

source: Create Account
ar: إنشاء حساب

# termsAndConditions
source: By creating an account, you agree to our Terms of Service and Privacy Policy
ar: بإنشائك حسابًا، أنت توافق على شروط الخدمة وسياسة الخصوصية

# pleaseSelectSpecialization
source: Please select your specialization
ar: يرجى اختيار التخصص

source: Professional Information
ar: المعلومات المهنية

# medicalLicense
source: Medical License (PDF)
ar: الترخيص الطبي (PDF)

# uploadMedicalLicense
source: Upload your medical license
ar: قم برفع الترخيص الطبي

source: Browse
ar: تصفح

source: File uploaded successfully
ar: تم رفع الملف بنجاح

# pleaseUploadMedicalLicense
source: Please upload your medical license
ar: يرجى رفع الترخيص الطبي

source: Please Enter National ID
ar: الرجاء إدخال الرقم القومي

source: Account created successfully!
ar: تم إنشاء الحساب بنجاح!

source: Error picking file
ar: خطأ اختيار الملف

source: Registration failed
ar: فشل التسجيل

source: Doctor Profile
ar: ملف الطبيب

source: Available
ar: متاح

source: Experience
ar: الخبرة

source: years
ar: سنة

source: Available Doctors
ar: الأطباء المتاحون

source: Search doctor name
ar: ابحث باسم الطبيب

# doctorsAvailable
source: {count} doctors available
ar: {count} طبيب متاح

source: No doctors found
ar: لم يتم العثور على أطباء

# tryAdjustingSearch
source: Try adjusting your search or filters
ar: حاول تعديل البحث أو الفلاتر

source: Verify Doctors
ar: التحقق من الأطباء

source: Pending verification
ar: في انتظار التحقق

source: No doctors pending verification
ar: لا يوجد أطباء في انتظار التحقق

# allApplicationsProcessed
source: All applications have been processed
ar: تمت معالجة جميع الطلبات

source: Doctor Verification
ar: التحقق من الطبيب

source: Accept
ar: قبول

source: Reject
ar: رفض

source: View
ar: عرض

source: License
ar: الترخيص

source: Doctor rejected successfully
ar: تم رفض الطبيب بنجاح

# doctorAcceptedSuccessfully
source: Doctor accepted and moved to active doctors list
ar: تم قبول الطبيب ونقله إلى قائمة الأطباء النشطين

source: Doctors
ar: الأطباء

source: Status
ar: الحالة

source: Inactive
ar: غير نشط

source: Suspend
ar: تعليق

source: Unsuspend
ar: إلغاء التعليق

# patientStatusUpdated
source: Patient status updated to {status}
ar: تم تحديث حالة الطبيب إلى {status}

source: Are you sure you want to
ar: هل أنت متأكد أنك تريد

source: Doctor
ar: دكتور

source: Failed to update status
ar: تعذّر تحديث الحالة

source: Failed to load doctors
ar: فشل في تحميل قائمة الأطباء

source: Suspend Doctor
ar: تعليق الطبيب

source: Unsuspend Doctor
ar: إلغاء تعليق الطبيب

# areYouSureSuspend
source: Are you sure you want to suspend {name}?
ar: هل أنت متأكد أنك تريد تعليق {name}؟

# areYouSureUnsuspend
source: Are you sure you want to unsuspend {name}?
ar: هل أنت متأكد أنك تريد إلغاء تعليق {name}؟

source: Doctor suspended successfully
ar: تم تعليق الطبيب بنجاح

source: Doctor unsuspended successfully
ar: تم إلغاء تعليق الطبيب بنجاح

source: Failed to load patients
ar: فشل في تحميل قائمة المرضى

source: Select Patient
ar: اختر المريض

source: Patient Found
ar: تم العثور على المريض

# confirmPatientIdentity
source: Please confirm the patient identity to continue
ar: يرجى تأكيد هوية المريض للمتابعة

source: View Patient
ar: عرض المريض

source: Patient Identification
ar: تحديد هوية المريض

source: Search by National ID
ar: البحث بالرقم القومي

source: Enter 14-digit National ID
ar: أدخل الرقم القومي المكون من 14 رقمًا

source: Search Patient
ar: بحث عن مريض

source: OR
ar: أو

source: Scan Patient QR Code
ar: مسح رمز QR الخاص بالمريض

source: Open QR Scanner
ar: فتح ماسح QR

source: Type Prescription
ar: كتابة وصفة

source: Session Options
ar: خيارات الجلسة

# chooseSessionAction
source: Choose what you would like to do with {name}
ar: اختر ما تريد القيام به مع {name}

source: View History
ar: عرض التاريخ الطبي

# reviewMedicalHistory
source: Review {name}'s medical history
ar: راجع التاريخ الطبي لـ{name}

source: End Session
ar: إنهاء الجلسة

# areYouSureEndSession
source: Are you sure you want to end session with {name}?
ar: هل أنت متأكد أنك تريد إنهاء الجلسة مع {name}؟

source: Previous
ar: السابق

source: Next Step
ar: الخطوة التالية

source: Preview
ar: معاينة

source: Diagnosis
ar: التشخيص

# stepOf
source: Step {current} of {total}
ar: الخطوة {current} من {total}

# pleaseEnterDiagnosis
source: Please enter a diagnosis
ar: يرجى إدخال التشخيص
