Repository: nourankhaled22/Smart-Prescription-System
Catalog: FrontEnd/lib/l10n/app_*.arb
Languages: ar

source: Please add at least one medication
ar: يرجى إضافة دواء واحد على الأقل

source: Edit
ar: تعديل

source: Publish
ar: نشر

source: Prescription Completed
ar: تم إكمال الوصفة

# prescriptionGeneratedSaved
source: The prescription has been successfully generated and saved to the patient's medical records.
ar: تم إنشاء الوصفة الطبية وحفظها في السجل الطبي للمريض بنجاح.

source: Done
ar: تم

source: Patient Information
ar: معلومات المريض

source: Name
ar: الاسم

# examinationsSection
source: Examinations
ar: الفحوصات

source: Prescription saved successfully!
ar: تم حفظ الوصفة بنجاح!

# failedToSavePrescription
source: Failed to save prescription: {error}
ar: فشل في حفظ الوصفة: {error}

# createNewPrescriptionFor
source: Create a new prescription for {name}
ar: إنشاء وصفة طبية جديدة لـ {name}

source: Scan QR Code
ar: مسح رمز QR

# positionQrCode
source: Position the QR code within the frame to scan
ar: ضع رمز QR داخل الإطار للمسح

source: Flash On
ar: تشغيل الفلاش

source: Flash Off
ar: إيقاف الفلاش

source: Capture
ar: التقاط

source: Manual Entry
ar: إدخال يدوي

source: Processing QR Code...
ar: جارٍ معالجة رمز QR...

source: Invalid QR Code
ar: رمز QR غير صالح

source: Total Sessions
ar: إجمالي الجلسات

source: Patients
ar: المرضى

source: Filter Sessions
ar: تصفية الجلسات

# searchByPatient
source: Search by patient name or ID...
ar: ابحث باسم المريض أو الرقم القومي...

source: No Sessions Found
ar: لا توجد جلسات

# noSessionsFoundMatching
source: No sessions found matching "{query}"
ar: لا توجد جلسات مطابقة لـ "{query}"

# noPatientSessionsFound
source: No patient sessions found for the selected time period.
ar: لا توجد جلسات للمرضى للفترة الزمنية المحددة.

source: Session Date
ar: تاريخ الجلسة

source: Session Notes
ar: ملاحظات الجلسة

source: No notes available
ar: لا توجد ملاحظات

source: Yesterday
ar: أمس

# atTime
source: {date} at {time}
ar: {date} في {time}

# loginFailed
source: Login failed. Please try again.
ar: فشل تسجيل الدخول. يرجى المحاولة مرة أخرى.

# noAccount
source: Don't have an account?
ar: ليس لديك حساب؟

source: Sign Up
ar: إنشاء حساب

source: Cancel
ar: إلغاء

source: Search for medicine
ar: البحث عن دواء

# createDoctorAccount
source: Create a doctor account to manage patients and sessions
ar: أنشئ حساب طبيب لإدارة المرضى والجلسات

# agreeToTerms
source: By continuing, you agree to our Terms & Privacy Policy
ar: بالمتابعة، فإنك توافق على الشروط وسياسة الخصوصية الخاصة بنا

# chooseYourRole
source: Choose your role to get started
ar: اختر دورك للبدء

source: Patient
ar: مريض

# createPatientAccount
source: Create a patient account to access medical services
ar: أنشئ حساب مريض للوصول إلى الخدمات الطبية

source: Delete Medication
ar: حذف الدواء

# deleteMedicationConfirm
source: Are you sure you want to delete this medication?
ar: هل أنت متأكد أنك تريد حذف هذا الدواء؟

source: Chronic Disease
ar: مرض مزمن

source: Medications
ar: الأدوية

source: Generate History Summary
ar: إنشاء ملخص التاريخ الطبي

source: Patient History
ar: تاريخ المريض

source: Medical Assistant
ar: المساعد الطبي

# medicalAssistantWelcome
source: Hello! I'm your medical assistant. How can I help you today? You can ask me about symptoms, medications, or general health advice.
ar: مرحبًا! أنا مساعدك الطبي. كيف يمكنني مساعدتك اليوم؟ يمكنك سؤالي عن الأعراض أو الأدوية أو النصائح الصحية العامة.

# medicalAssistantAskAnything
source: Ask me anything about your health, symptoms, or medical advice.
ar: اسألني عن صحتك أو الأعراض أو النصائح الطبية.

# medicalAssistantInfoTitle
source: Medical Assistant Info
ar: معلومات المساعد الطبي

# medicalAssistantInfoDesc
source: This medical chatbot provides general health information only.
ar: هذا الروبوت الطبي يوفر معلومات صحية عامة فقط.

# medicalAssistantDisclaimer
source: Important Disclaimer:
ar: تنويه هام:

# medicalAssistantDisclaimerBullets
source: • Not a substitute for professional medical advice • In case of emergency, call emergency services • Always consult with qualified healthcare providers
ar: • ليس بديلاً عن الاستشارة الطبية المهنية • في حالة الطوارئ، اتصل بخدمات الطوارئ • استشر دائمًا مقدمي الرعاية الصحية المؤهلين

source: Close
ar: إغلاق

source: Type your health question...
ar: اكتب سؤالك الصحي...

# suggestionHeadache1
source: Is it a migraine?
ar: هل هو صداع نصفي؟

# suggestionHeadache2
source: Natural headache remedies
ar: علاجات طبيعية للصداع

# suggestionHeadache3
source: When to see a doctor
ar: متى تزور الطبيب؟

# suggestionCold1
source: Cold vs. flu symptoms
ar: الفرق بين البرد والإنفلونزا

# suggestionCold2
source: Natural cold remedies
ar: علاجات طبيعية للبرد

# suggestionCold3
source: COVID vs. cold
ar: كورونا أم برد؟

# suggestionBloodPressure1
source: DASH diet details
ar: تفاصيل حمية DASH

# suggestionBloodPressure2
source: Blood pressure readings
ar: قراءات ضغط الدم

# suggestionBloodPressure3
source: Heart-healthy foods
ar: أطعمة مفيدة للقلب

# suggestionWater1
source: Signs of dehydration
ar: علامات الجفاف

# suggestionWater2
source: Best times to drink water
ar: أفضل أوقات شرب الماء

# suggestionWater3
source: Water alternatives
ar: بدائل الماء

# suggestionCommon1
source: Common symptoms
ar: أعراض شائعة

# suggestionCommon2
source: Preventive health
ar: الصحة الوقائية

# suggestionCommon3
source: Nutrition advice
ar: نصائح غذائية

# suggestionCommon4
source: Exercise recommendations
ar: تمارين موصى بها

source: Diagnosed
ar: تم التشخيص

source: Diagnosed: Unknown
ar: تم التشخيص: غير معروف

source: Verify
ar: تحقق

# detailedDiagnosisHint
source: Enter detailed diagnosis... Example: • Primary diagnosis • Secondary conditions • Symptoms observed
ar: أدخل التشخيص التفصيلي... مثال: • التشخيص الأساسي • الحالات الثانوية • الأعراض الملحوظة

source: Add Examination
ar: إضافة فحص

# examinationNameHint
source: e.g., Physical Examination, Heart Examination
ar: مثال: الفحص السريري، فحص القلب

# pleaseFillName
source: Please fill in both name and notes
ar: يرجى إدخال الاسم والملاحظات

# recordPhysicalFindings
source: Record physical examination findings
ar: سجل نتائج الفحص السريري

source: No examinations recorded
ar: لا توجد فحوصات مسجلة

# addPhysicalFindings
source: Add physical examination findings
ar: أضف نتائج الفحص السريري

source: No chronic diseases found
ar: لا توجد أمراض مزمنة

source: No blood pressure readings found
ar: لا توجد قراءات لضغط الدم

source: No Data Available
ar: لا توجد بيانات متاحة

# pdfDownloaded
source: PDF downloaded to Downloads folder
ar: تم تنزيل ملف PDF إلى مجلد التنزيلات

# failedToDownloadPdf
source: Failed to download PDF: {error}
ar: فشل في تنزيل ملف PDF: {error}

source: Chronic Diseases
ar: الأمراض المزمنة

source: Search chronic diseases...
ar: ابحث عن الأمراض المزمنة...

source: Search medications...
ar: ابحث عن الأدوية...

source: Search...
ar: بحث...

source: Filter by Date:
ar: تصفية حسب التاريخ:

source: All Time
ar: كل الوقت

source: Last 7 Days
ar: آخر 7 أيام

source: Last 30 Days
ar: آخر 30 يومًا

source: Custom Date
ar: تاريخ مخصص

# selected
source: Selected: {date}
ar: المحدد: {date}

source: Filter by Level:
ar: تصفية حسب المستوى:

source: Filter by Status:
ar: تصفية حسب الحالة:

source: Chronic
ar: مزمن

# addPrescribedMedications
source: Add prescribed medications with dosage and timing
ar: أضف الأدوية الموصوفة مع الجرعة والتوقيت

source: No medications added yet
ar: لم تتم إضافة أدوية بعد

# tapAddMedicineToStart
source: Tap "Add Medicine" to start prescribing
ar: اضغط "إضافة دواء" لبدء الوصفة

source: times daily
ar: مرات يومياً

# medicineNameRequired
source: Medicine Name *
ar: اسم الدواء *

# medicineNameHint
source: e.g., Paracetamol
ar: مثال: باراسيتامول

# dosageRequired
source: Dosage *
ar: الجرعة *

# dosageHint
source: e.g. 500 mg
ar: مثال: 500 ملغ

# pleaseFillRequiredFields
source: Please fill in required fields
ar: يرجى تعبئة الحقول المطلوبة

# next
source: Next: {time}
ar: التالي: {time}

# tablet
source: tablet(s)
ar: قرص(أقراص)

source: days
ar: يوم

source: Preview Prescription
ar: معاينة الوصفة

source: Additional Notes
ar: ملاحظات إضافية

# addFollowUpInstructions
source: Add follow-up instructions and recommendations
ar: أضف تعليمات المتابعة والتوصيات

# notesHint
source: Enter additional notes, recommendations, or follow-up instructions... Example: • Take medication with food • Avoid strenuous activities • Return if symptoms worsen • Follow-up in 1 week
ar: أدخل ملاحظات إضافية أو توصيات أو تعليمات للمتابعة... مثال: • تناول الدواء مع الطعام • تجنب الأنشطة المجهدة • العودة إذا ساءت الأعراض • متابعة بعد أسبوع

source: Quick Follow-up Options
ar: خيارات متابعة سريعة

# tapOptionToAdd
source: Tap any option to add to notes:
ar: اضغط على أي خيار لإضافته إلى الملاحظات:

# followUp1Week
source: Follow-up in 1 week
ar: متابعة بعد أسبوع

# followUp2Weeks
source: Follow-up in 2 weeks
ar: متابعة بعد أسبوعين

# followUp1Month
source: Follow-up in 1 month
ar: متابعة بعد شهر

source: Lab tests required
ar: مطلوب تحاليل مخبرية

source: Specialist referral needed
ar: مطلوب تحويل إلى أخصائي

source: Complete medication course
ar: إكمال كورس الدواء

source: Return if symptoms worsen
ar: العودة إذا ساءت الأعراض

source: Rest and hydration
ar: الراحة وشرب السوائل

source: No follow-up needed
ar: لا حاجة للمتابعة

# doctorPrefix
source: Dr.
ar: د.

source: Unknown
ar: غير معروف

# stepPatient
source: Patient
ar: المريض

# stepHistory
source: History
ar: التاريخ

# stepExamination
source: Examination
ar: الفحص

# stepDiagnosis
source: Diagnosis
ar: التشخيص

# stepMedications
source: Medications
ar: الأدوية

# stepNotes
source: Notes
ar: ملاحظات

# stepPreview
source: Preview
ar: معاينة

# vaccineDate
source: Date: {date}
ar: التاريخ: {date}

# vaccineDateNA
source: Date: N/A
ar: التاريخ: غير متوفر

# dateLabel
source: Date: {date}
ar: التاريخ: {date}

# dateNotAvailable
source: Date: N/A
ar: التاريخ: غير متوفر

# stepTitle1
source: Personal Info
ar: المعلومات الشخصية

# stepTitle2
source: Details
ar: التفاصيل

# historySummaryTitle
source: History Summary
ar: ملخص التاريخ

source: Generating History Summary...
ar: جاري إنشاء ملخص التاريخ...

source: No Available History
ar: لا يوجد تاريخ متاح

# noHistorySummaryGenerated
source: We couldn't generate a history summary for your history.
ar: لم نتمكن من إنشاء ملخص للتاريخ الخاص بك.

source: Health Summary
ar: ملخص صحي

source: No health_summary available
ar: لا يوجد ملخص صحي متاح

source: Blood Pressure Insights
ar: معلومات ضغط الدم

# tipsAndGuides
source: Tips & Guides
ar: نصائح وإرشادات

source: General Advices About Medicines
ar: نصائح عامة حول الأدوية

source: Vaccine Information
ar: معلومات اللقاح

source: Allergy Information
ar: معلومات الحساسية

source: Medicines Information
ar: معلومات الأدوية

# failedToFetchHistorySummary
source: Failed to fetch history summary. Please check your internet connection and try again.
ar: فشل في جلب ملخص التاريخ. يرجى التحقق من اتصال الإنترنت والمحاولة مرة أخرى.

source: Login
ar: تسجيل الدخول

source: Downloading...
ar: جاري التحميل...
